# Переменные булева типа могут принимать только два значения.
# С помощью оператора сравнения == выведите два возможных значения переменной is_equal.
# Обратите внимание на результат применения функции int() к булевому значению.
two = 2
three = 3
is_equal = two == three
is_greater = three > two
print(int(is_equal))

#

print(str(is_greater))

"""
В языке Python поддерживается множество операций сравнения( ==, >=, < и т.д.).
Все подобные операции имеют одинаковый приоритет. Результат сравнения - булева переменная.
Сравнения могут осуществляться в любом порядке.
"""


one = 1

two = 2

three = 3

print(one < two < three)  # Сравнения (one < two) и (two < three) происходят в одно и то же время.

# Создайте несколько переменных и осуществите различные сравнения между ними, выведите результаты в консоль.
four = 4
five = 5
six = 6
print(four > five < six)
print(four <= five < six)
print(four < five > six)


# Задание 7
print('Hello, ' + input('Как вас зовут'))

# Вычисление варианта
print((int(input('Дата вашего рождения')) + int(input('Номер месяца вашего рождения'))) % 4 + 1)

# Решение уравнения второго варианта
from math import exp, sqrt
x = float(input())
print(exp(sqrt(x + sqrt(x))))

# Решение геометрической задачи второго варианта
a = float(input())
print((4 * sqrt(3) ** (-1)) * (3 + sqrt(5)) * a)